artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 15
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "User session flow"
    weight: 60
    flow:
      - get:
          url: "/"
      - think: 2
      - post:
          url: "/api/auth/signin"
          json:
            email: "test@example.com"
            password: "password123"
      - think: 1
      - get:
          url: "/api/sparks"
      - think: 3
      - post:
          url: "/api/sparks"
          json:
            title: "Load Test Spark"
            description: "Created during load test"

  - name: "Read-heavy operations"
    weight: 30
    flow:
      - get:
          url: "/api/sparks"
      - think: 1
      - get:
          url: "/api/users/profile"
      - think: 2
      - get:
          url: "/api/achievements"

  - name: "Write operations"
    weight: 10
    flow:
      - post:
          url: "/api/sparks"
          json:
            title: "Performance Test Spark {{ $randomString() }}"
            description: "Testing write performance"
      - think: 1
      - put:
          url: "/api/sparks/{{ sparkId }}"
          json:
            title: "Updated Spark {{ $randomString() }}"